<?php


$similar_products = [
    1 =>[
        'title' => 'First pro"duct', 
        'price' => 355.99,
        'fav' => false,
        'ends' => false,
        'sku' => 721558448,
        'rating' => 5,
        'images' => [
            'http',
            'http',
            'http',
        ],
        'reviews' => 0,
        'questions' => 45,
        'tab' => 1,
        'fast_info' => 'Стандарт связи 2G (GPRS/EDGE) 2G (GSM) <br> Диагональ экрана 1.77 <br> Емкость аккумулятора 800 мА*ч 
        <br> Оперативная память 32 МБ <br> Разрешение дисплея 128x160 <br> Тип матрицы TFT <br> Встроенная память 32 МБ 
        <br> Операционная система Другая <br> Количество СИМ-карт 2 <br> Размеры СИМ-карты Mini-SIM <br> Частота до 500 МГц 
        <br> Формат поддерживаемых карт памяти microSD <br> Максимальный объем поддерживаемой карты памяти 16 ГБ',
        'fast_info' => [
            'Стандарт связи' => '2G (GPRS/EDGE) 2G (GSM)',
            'Диагональ экрана' => '1.77',
            'Емкость аккумулятора' => '800 мА*ч',
            'Оперативная память' => '32 МБ',
            'Разрешение дисплея' => '128x160',
            'Тип матрицы' => 'TFT',
            'Встроенная память' => '32 МБ',
            'Операционная система' => 'Другая',
            'Количество СИМ-карт' => '2',
            'Размеры СИМ-карты' => 'Mini-SIM',
            'Частота до' => '500 МГц',
            'Формат поддерживаемых карт памяти' => 'microSD',
        ]
    ],
    
    2 =>[
        'title' => 'Second product', 
        'price' => 420.99,
        'fav' => true,
        'ends' => false,
        'sku' => 5548995,
        'rating' => 4,
        'reviews' => 95,
        'questions' => 0,
        'tab' => 2,
        'imgthumbnail' => 'https://content2.rozetka.com.ua/goods/images/big_tile/20491192.jpg',
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
        'fast_info' => [
            'Стандарт связи' => '2G (GPRS/EDGE) 2G (GSM)',
            'Диагональ экрана' => '1.77',
            'Емкость аккумулятора' => '800 мА*ч',
            'Оперативная память' => '32 МБ',
            'Разрешение дисплея' => '128x160',
            'Тип матрицы' => 'TFT',
            'Встроенная память' => '32 МБ',
            'Операционная система' => 'Другая',
            'Количество СИМ-карт' => '2',
            'Размеры СИМ-карты' => 'Mini-SIM',
            'Частота до' => '500 МГц',
            'Формат поддерживаемых карт памяти' => 'microSD',
        ]
        
    ],

    3 =>[
        'title' => 'Third product', 
        'price' => 146.99,
        'old_price' => '259.35',
        'fav' => true,
        'ends' => false,
        'sku' => 'dfg56468sg',
        'rating' => 1,
        'reviews' => 24,
        'questions' => 29,
        'fast_info' => 'Экран (6.9", Dynamic AMOLED 2X, 3088x1440) <br> Samsung Exynos 990 (2 x 2.73 ГГц + 2 x 2.5 ГГц + 4 x 2.0 ГГц) <br> 
        тройная основная камера: 108 Мп + 12 Мп + 12 Мп, <br> фронтальная: 10 Мп / RAM 8 ГБ / 256 ГБ <br> 
        встроенной памяти + microSD (до 1 ТБ) / 3G / LTE / GPS / <br> поддержка 2х SIM-карт (Nano-SIM) / Android 10 / 4500 мА*ч',
        'finger_print' => '1',
        'fast_info' => [
            'Стандарт связи' => '2G (GPRS/EDGE) 2G (GSM)',
            'Диагональ экрана' => '1.77',
            'Емкость аккумулятора' => '800 мА*ч',
            'Оперативная память' => '32 МБ',
            'Разрешение дисплея' => '128x160',
            'Тип матрицы' => 'TFT',
            'Встроенная память' => '32 МБ',
            'Операционная система' => 'Другая',
            'Количество СИМ-карт' => '2',
            'Размеры СИМ-карты' => 'Mini-SIM',
            'Частота до' => '500 МГц',
            'Формат поддерживаемых карт памяти' => 'microSD',
        ]
    ],

    4 =>[
        'title' => 'Fourth product', 
        'price' => 852.66,
        'old_price' => 1596.99,
        'fav' => true,
        'ends' => false,
        'sku' => 7215544741,
        'rating' => 2,
        'reviews' => 30,
        'questions' => 95,
        'fast_info' => 'Экран (6.78", AMOLED, 2448x1080) / Qualcomm Snapdragon 888 (2.84 ГГц) <br> 
        тройная основная камера: 64 Мп + 13 Мп + 5 Мп, <br> фронтальная 24 Мп / RAM 8 ГБ / 128 ГБ <br> 
        встроенной памяти / 3G / LTE / 5G / GPS / <br> поддержка 2х SIM-карт (Nano-SIM) / Android 11 / 6000 мА*ч,',
    ],

    5 =>[
        'title' => 'Fifth product', 
        'price' => 987.56,
        'fav' => true,
        'ends' => true,
        'sku' => 72155777,
        'rating' => 4,
        'reviews' => 36,
        'questions' => 11,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],

    6 =>[
        'title' => 'Sixth product', 
        'price' => 365.85,
        'old_price' => 500,
        'fav' => true,
        'ends' => false,
        'sku' => 721551225,
        'rating' => 3,
        'reviews' => 32,
        'questions' => 65,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],

    7 =>[
        'title' => 'Seventh product', 
        'price' => 254.47,
        'fav' => false,
        'ends' => false,
        'sku' => 7215578923,
        'rating' => 1,
        'reviews' => 44,
        'questions' => 35,
        'fast_info' => 'Экран (6.9", Dynamic AMOLED 2X, 3088x1440) <br> Samsung Exynos 990 (2 x 2.73 ГГц + 2 x 2.5 ГГц + 4 x 2.0 ГГц) <br> 
        тройная основная камера: 108 Мп + 12 Мп + 12 Мп, <br> фронтальная: 10 Мп / RAM 8 ГБ / 256 ГБ <br> 
        встроенной памяти + microSD (до 1 ТБ) / 3G / LTE / GPS / <br> поддержка 2х SIM-карт (Nano-SIM) / Android 10 / 4500 мА*ч',
        'fast_info_img' => 'img/finger-ingo.png',
    ],

    8 =>[
        'title' => 'Eights product', 
        'price' => 140.56,
        'fav' => true,
        'ends' => true,
        'sku' => 72152335,
        'rating' => 5,
        'reviews' => 88,
        'questions' => 47,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],

    9 =>[
        'title' => 'First product 2', 
        'price' => 355.99,
        'fav' => false,
        'ends' => false,
        'sku' => 721558448,
        'rating' => 5,
        'images' => [
            'http',
            'http',
            'http',
        ],
        'reviews' => 0,
        'questions' => 45,
        'tab' => 1,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],
    
    10 =>[
        'title' => 'Second product 2', 
        'price' => 420.99,
        'fav' => true,
        'ends' => false,
        'sku' => 5548995,
        'rating' => 4,
        'reviews' => 95,
        'questions' => 0,
        'tab' => 2,
        'imgthumbnail' => 'https://content2.rozetka.com.ua/goods/images/big_tile/20491192.jpg',
        'fast_info' => 'Экран (6.9", Dynamic AMOLED 2X, 3088x1440) <br> Samsung Exynos 990 (2 x 2.73 ГГц + 2 x 2.5 ГГц + 4 x 2.0 ГГц) <br> 
        тройная основная камера: 108 Мп + 12 Мп + 12 Мп, <br> фронтальная: 10 Мп / RAM 8 ГБ / 256 ГБ <br> 
        встроенной памяти + microSD (до 1 ТБ) / 3G / LTE / GPS / <br> поддержка 2х SIM-карт (Nano-SIM) / Android 10 / 4500 мА*ч',
        'fast_info_img' => 'img/finger-ingo.png',
        
    ],

    11 =>[
        'title' => 'Third product 2', 
        'price' => 146.99,
        'old_price' => '259.35',
        'fav' => true,
        'ends' => false,
        'sku' => 'dfg56468sg',
        'rating' => 1,
        'reviews' => 24,
        'questions' => 29,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],

    12 =>[
        'title' => 'Fourth product 2', 
        'price' => 852.66,
        'old_price' => 1596.99,
        'fav' => true,
        'ends' => false,
        'sku' => 7215544741,
        'rating' => 2,
        'reviews' => 30,
        'questions' => 95,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],

    13 =>[
        'title' => 'Fifth product 2', 
        'price' => 987.56,
        'fav' => true,
        'ends' => true,
        'sku' => 72155777,
        'rating' => 4,
        'reviews' => 36,
        'questions' => 11,
        'fast_info' => 'Экран (6.9", Dynamic AMOLED 2X, 3088x1440) <br> Samsung Exynos 990 (2 x 2.73 ГГц + 2 x 2.5 ГГц + 4 x 2.0 ГГц) <br> 
        тройная основная камера: 108 Мп + 12 Мп + 12 Мп, <br> фронтальная: 10 Мп / RAM 8 ГБ / 256 ГБ <br> 
        встроенной памяти + microSD (до 1 ТБ) / 3G / LTE / GPS / <br> поддержка 2х SIM-карт (Nano-SIM) / Android 10 / 4500 мА*ч',
        'fast_info_img' => 'img/finger-ingo.png',
    ],

    14 =>[
        'title' => 'Sixth product 2', 
        'price' => 365.85,
        'old_price' => 500,
        'fav' => true,
        'ends' => false,
        'sku' => 721551225,
        'rating' => 3,
        'reviews' => 32,
        'questions' => 65,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',
    ],

    15 =>[
        'title' => 'Seventh product 2', 
        'price' => 254.47,
        'fav' => false,
        'ends' => false,
        'sku' => 7215578923,
        'rating' => '',
        'reviews' => 44,
        'questions' => 35,
        'fast_info' => 'Стандарт связи 3G <br> Диагональ экрана 5.9 <br> Емкость аккумулятора 4000 мА*ч <br> Оперативная память 8 ГБ 
        <br> Количество мегапикселей основной камеры 64 Мп <br> Количество мегапикселей фронтальной камеры 12 Мп <br> Разрешение дисплея 2400 x 1080 
        <br> Тип матрицы AMOLED <br> Встроенная память 256 ГБ <br> Операционная система Android <br> Количество СИМ-карт 2 
        <br> Размеры СИМ-карты Mini-SIM Частота 2.84 ГГц',

    ],

    16 =>[
        'title' => 'Eights product 2', 
        'price' => 140.56,
        'fav' => true,
        'ends' => true,
        'sku' => 72152335,
        'rating' => 5,
        'reviews' => 88,
        'questions' => 47,
        'fast_info' => 'Экран (6.9", Dynamic AMOLED 2X, 3088x1440) <br> Samsung Exynos 990 (2 x 2.73 ГГц + 2 x 2.5 ГГц + 4 x 2.0 ГГц) <br> 
        тройная основная камера: 108 Мп + 12 Мп + 12 Мп, <br> фронтальная: 10 Мп / RAM 8 ГБ / 256 ГБ <br> 
        встроенной памяти + microSD (до 1 ТБ) / 3G / LTE / GPS / <br> поддержка 2х SIM-карт (Nano-SIM) / Android 10 / 4500 мА*ч',
        'fast_info_img' => 'img/finger-ingo.png',
    ],
];

// $mysqli = new mysqli("localhost", "root", "", "rozetka");

// $result = $mysqli->query("SELECT * FROM products");

// for ($row_no = $result->num_rows - 1; $row_no >= 0; $row_no--) {
//     $result->data_seek($row_no);
//     $row = $result->fetch_assoc();
//     pa($row['name']);
// }

?>